In [37]:
## 개별 원소에 함수 매핑
# 시리즈의 원소에  apply()적용

# 라이브러리 불러오기
import seaborn as sns
import pandas as pd

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [2]:
# 사용자 함수 정의
def add_10(n):
    return n + 10

def add_two_obj(a,b):
    return a + b

print(add_10(10))
print(add_two_obj(10, 10))

20
20

In [3]:
# 미션 1-1
# 시리즈 객체에 적용
sr1 = df['age'].apply(add_10) #df['age']열에 add_10 함수를 적용하면 모든 원소에 숫자 10을 더한 시리즈가 생성됨
sr1.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [42]:
# 람다 함수 활용: 시리즈 객체에 적용
sr2 = df['age'].apply(lambda n:n +10)
sr2.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [41]:
## 미션 1-2
# 람다 함수 활용: 시리즈 객체에 적용
sr1_2 = df['age'].apply(lambda n:n *5)
sr1_2.head()

0    110.0
1    190.0
2    130.0
3    175.0
4    175.0
Name: age, dtype: float64

In [8]:
# 함수의 매개변수가 2개 이상인 경우 (예: 시리즈 + 숫자)
sr3 = df['age'].apply(add_two_obj, b = 10)
sr3.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [9]:
# 함수의 매개변수가 2개 이상인 경우(람다 함수 활용)
sr4 = df['age'].apply(lambda a, b: a+b, b=10)
sr4.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [10]:
# 시리즈의 원소에 map() 적용
# 시리즈 객체에 함수를 적용
def over_thirty(age):
    return age > 30

sr_map=df['age'].map(over_thirty)
sr_map.head()

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [11]:
# 시리즈 객체에 함수를 적용(람다 함수 활용)
sr_map2 = df['age'].map(lambda age: True if age > 30 else False)
sr_map2.head()

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [13]:
# titanic 데이터의 성별 데이터의 고유값
print(titanic['sex'].unique())
print(titanic['sex'].head())

# 딕셔너리 정의하여 값을 변환(문자열 -> 정수)
over_forty_dict = {'male':0, 'female':1}
titanic['gender'] = titanic['sex'].map(over_forty_dict)
print(titanic['gender'].head())

['male' 'female']
0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object
0    0
1    1
2    1
3    1
4    0
Name: gender, dtype: int64

In [14]:
# 데이터프레임 원소에 함수 매핑
# 데이터프레임 원소에 map() 적용

# 라이브러리 불러오기
import seaborn as sns
import pandas as pd

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

# 사용자 함수 정의
def add_10(n):
    return n + 10

def add_two_obj(a,b):
    return a + b

# 데이터프레임의 모든 원소를 add_10() 함수에 매핑
df1 = df.map(add_10)
df1.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [15]:
# 람다 함수 활용
df2 = df.map(lambda n:n+10)
df2.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [43]:
df1_2 = df.map(lambda n:n*5)
df1_2.head()

     age      fare
0  110.0   36.2500
1  190.0  356.4165
2  130.0   39.6250
3  175.0  265.5000
4  175.0   40.2500

In [17]:
# 함수의 매개변수가 2개 이상인 경우
df3=df.map(add_two_obj, b=10)
df3.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [19]:
# 함수의 매개변수가 2개 이상인 경우(람다 함수 활용)
df4=df.map(lambda a, b: a+b, b=10)
df4.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [44]:
## 시리즈 객체에 함수 매핑
# 데이터프레임의 각 열에 함수 매핑
# 데이터프레임에 apply(axis=0) 적용

# 라이브러리 불러오기
import seaborn as sns
import pandas as pd

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [46]:
# 각 열에 대한 최댓값, 최솟값, 평균, 중앙값을 계산하는 함수
def calculate_stats(col):

    max_val = col.max()
    min_val = col.min()
    mean_val = col.mean()
    median_val = col.median()

    # 새로운 시리즈 반환
    return pd.Series([max_val, min_val, mean_val, median_val], index=['Max', 'Min', 'Mean', 'Median'])

# 각 열에 calculate_stats 함수 적용(데이터프레임을 반환)
result_df = df.apply(calculate_stats, axis=0)

result_df

              age        fare
Max     80.000000  512.329200
Min      0.420000    0.000000
Mean    29.699118   32.204208
Median  28.000000   14.454200

In [45]:
# 각 열에 람다 함수 적용(시리즈를 반환)
result_sr = df.apply(lambda x: x.max() - x.min(), axis=0)

result_sr

age      79.5800
fare    512.3292
dtype: float64

In [26]:
# 데이터프레임의 각 행에 함수 매핑
# 데이터프레임에 apply(axis=1) 적용

# 각 행에 대해 최댓값과 최솟값의 차이와 평균을 구하는 함수
def calculate_diff_avg(row):
    diff = row.max() - row.min()
    avg = row.mean()
    # 새로운 시리즈 반환
    return pd.Series([diff, avg], index=['차이', '평균'])

# apply 함수를 사용하여 각 행에 calculate_diff_avg 함수 적용
result_df2=df.apply(calculate_diff_avg, axis=1)

result_df2

          차이        평균
0    14.7500  14.62500
1    33.2833  54.64165
2    18.0750  16.96250
3    18.1000  44.05000
4    26.9500  21.52500
..       ...       ...
886  14.0000  20.00000
887  11.0000  24.50000
888   0.0000  23.45000
889   4.0000  28.00000
890  24.2500  19.87500

[891 rows x 2 columns]

In [29]:
# 람다 함수를 사용하여 각 행에 대해 계산 적용(multiplier 매개변수를 추가)
result_df3=df.apply(lambda row: pd.Series([(row.max() - row.min()) * multiplier, row.mean()],
                                         index=['차이', '평균']),
                   multiplier = 2, axis=1)

result_df3

TypeError: <lambda>() got an unexpected keyword argument 'multiplier'

In [48]:
# 함수 매핑 응용 - 조건식을 만족하는 열을 필터링
# 평균값이 30을 초과하는 열만 필터링
filtered_columns = df.apply(lambda x: x.mean() > 30)
print(filtered_columns, '\n')

# 필터링된 열을 기반으로 새로운 데이터프레임 생성
filtered_df = df.loc[:, filtered_columns]

filtered_df

age     False
fare     True
dtype: bool

        fare
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
..       ...
886  13.0000
887  30.0000
888  23.4500
889  30.0000
890   7.7500

[891 rows x 1 columns]

In [49]:
# 함수 매핑 응용 - 조건부 열 추가
# 각 행의 평균값이 50을 초과하는지 여부에 따라 'High' 열 추가
df['High']=df.apply(lambda row: 'High' if row.mean()>50 else 'Low', axis=1)

df

      age     fare  High
0    22.0   7.2500   Low
1    38.0  71.2833  High
2    26.0   7.9250   Low
3    35.0  53.1000   Low
4    35.0   8.0500   Low
..    ...      ...   ...
886  27.0  13.0000   Low
887  19.0  30.0000   Low
888   NaN  23.4500   Low
889  26.0  30.0000   Low
890  32.0   7.7500   Low

[891 rows x 3 columns]

In [51]:
## 데이터프레임 객체에 함수 매핑
# 데이터프레임 객체에 pipe() 적용

# 라이브러리 불러오기
import seaborn as sns
import pandas as pd

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df1 = titanic.loc[:, ['age', 'fare']]
df2 = titanic.loc[:, ['embark_town', 'embarked']]

# 각 열의 NaN 찾기 - 데이터프레임을 전달하면 데이터프레임을 반환
def missing_value(df):
    return df.isnull()

# 데이터프레임에 pipe() 메소드로 함수 매핑
result_df=df1.pipe(missing_value)

result_df

       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

In [34]:
# 각 열의 NaN 개수 반환 - 데이터프레임을 전달하면 시리즈 반환
def missing_count(df):
    return missing_value(df).sum()

result_series = df1.pipe(missing_count)

result_series

age     177
fare      0
dtype: int64

In [35]:
# 데이터프레임의 총  NaN 개수 - 데이터프레임을 전달하면 값 반환
def totoal_number_missing(df):
    return missing_count(df).sum()

result_value = df1.pipe(totoal_number_missing)

result_value

np.int64(177)

In [52]:
# 미션 4-1

# 중앙값으로 결측치 대체하는 함수 정의
def fill_median(df):
    return df.fillna(df.median(numeric_only=True))

# pipe로 함수 적용
df1_filled = df1.pipe(fill_median)

# 결과 확인
print(df1_filled.head())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [36]:
# chain method - 함수활용
def extract_initial(df):
    df['town_initial']=df['embark_town'].str[0]
    return df

def verify_initial(df):
    df['verified']=df['embarked'] == df['town_initial']
    return df

verify_initial(extract_initial(df2))

     embark_town embarked town_initial  verified
0    Southampton        S            S      True
1      Cherbourg        C            C      True
2    Southampton        S            S      True
3    Southampton        S            S      True
4    Southampton        S            S      True
..           ...      ...          ...       ...
886  Southampton        S            S      True
887  Southampton        S            S      True
888  Southampton        S            S      True
889    Cherbourg        C            C      True
890   Queenstown        Q            Q      True

[891 rows x 4 columns]

In [54]:
# chain method - pipe 활용
df2_processed = df2.pipe(extract_initial).pipe(verify_initial)
print(df2_processed[['embark_town', 'embarked', 'town_initial', 'verified']].head())

   embark_town embarked town_initial  verified
0  Southampton        S            S      True
1    Cherbourg        C            C      True
2  Southampton        S            S      True
3  Southampton        S            S      True
4  Southampton        S            S      True